Strömungssimulation/Beleg/wü_dt/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// DONE: Wählen Sie den korrekten Simulationstyp und ggf. ein geeignetes Turbulenzmodell
/*
simulationType laminar;

laminar
{
	model           generalisedNewtonian;
        viscosityModel  Newtonian;
}*/

simulationType RAS;

RAS
{
    model           kEpsilon; //kOmegaSST; kOmegaSST;

    turbulence      on;

    printCoeffs     on;

    viscosityModel  Newtonian;
}


// ************************************************************************* //
