Strömungssimulation/Beleg/wü_dt/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          293;      // 20 °C
Twall           353;      // 80 °C

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }

    outlet
    {
        type            zeroGradient;
    }

    "pipe.*"
    {
        type            fixedValue;
	    value		    uniform $Twall;
    }

    frontAndBack
    {
        type            empty;
    }

    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}

// ************************************************************************* //
