Strömungssimulation/Beleg/wü_dt/0/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
12634.4
12669.5
12669.4
12638.7
12638.7
12669.5
12631.2
12660.8
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
12670.6
12662.7
12704.9
12658.3
12649.7
12668.2
12670.1
12625.4
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
12664.9
12630.3
12665.3
12631.5
12636.7
12630.4
12628.3
12660.7
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
12673.4
12631.4
12628.8
12661
12631.4
12665.1
12637
12632.2
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
12638.9
12670.4
12670.3
12633.7
12668.1
12670.3
12670.4
12638.9
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
12625.8
12669.6
12634.2
12656.7
12668.3
12651
12625.1
12661.1
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
