Strömungssimulation/Beleg/wü_dt/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.158698 -0.021675 0)
(-0.159135 -0.0217333 1.89012e-20)
(-0.176606 -0.0233525 0)
(-0.176176 -0.023296 0)
(-0.176176 0.023296 0)
(-0.159135 0.0217333 -1.89012e-20)
(-0.151557 -0.0163068 6.63158e-21)
(-0.190465 -0.0127842 1.201e-20)
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.193844 0.00446353 -4.78257e-21)
(-0.190497 0.0127809 0)
(-0.194369 -0.00447164 -0)
(-0.190433 -0.0127729 -0)
(-0.190305 0.0127624 0)
(-0.159121 -0.0217323 -1.92778e-20)
(-0.152027 0.0163609 0)
(-0.158584 -0.0216593 6.3465e-21)
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.151962 -0.0163515 -7.18781e-21)
(-0.158646 -0.0216677 -1.05368e-20)
(-0.159082 0.0217261 -2.08637e-20)
(-0.158662 0.0216706 -6.07644e-21)
(-0.176148 0.0232925 1.47641e-20)
(-0.190015 -0.0127423 0)
(-0.176032 -0.0232765 0)
(-0.176484 0.0233366 -1.85879e-20)
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.190661 0.0127862 0)
(-0.19003 0.0127431 9.14765e-21)
(-0.17604 0.0232776 0)
(-0.176487 -0.0233372 1.85885e-20)
(-0.158665 0.0216719 1.05389e-20)
(-0.159082 -0.0217269 -0)
(-0.176157 -0.0232917 -1.47636e-20)
(-0.158667 -0.0216696 6.07411e-21)
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.176185 0.0232952 0)
(-0.176618 0.0233548 0)
(-0.159148 0.0217359 0)
(-0.158679 -0.0216688 -8.61939e-21)
(-0.152001 0.0163561 0)
(-0.159148 -0.0217359 0)
(-0.176618 -0.0233548 0)
(-0.176185 -0.0232952 0)
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.158589 -0.0216597 0)
(-0.152018 -0.0163575 0)
(-0.151592 0.016311 -3.68095e-21)
(-0.176426 -0.0233294 3.3191e-20)
(-0.159122 0.0217326 1.92734e-20)
(-0.190326 -0.0127632 -1.4529e-20)
(-0.193148 -0.00444585 0)
(-0.190477 -0.0127733 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
