Strömungssimulation/Beleg/wü_dt/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
2.60343
2.59983
2.59983
2.60299
2.60299
2.59983
2.60376
2.60072
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
2.59971
2.60052
2.5962
2.60098
2.60186
2.59996
2.59976
2.60436
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
2.6003
2.60386
2.60026
2.60374
2.6032
2.60385
2.60407
2.60073
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
2.59943
2.60375
2.60401
2.6007
2.60374
2.60027
2.60317
2.60366
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
2.60297
2.59973
2.59974
2.60351
2.59997
2.59974
2.59973
2.60297
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
2.60432
2.59982
2.60346
2.60114
2.59995
2.60172
2.60439
2.60069
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
