Strömungssimulation/Beleg/wü_dt/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.005;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-3;
        relTol          0;
    }

    "(rho|U|h|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.001;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
//    consistent		yes;

//    pRefCell 0;
//    pRefValue 0;

    residualControl
    {
        p               2e-4;
        U               1e-4;
        "(e|h|k|epsilon|omega|f|v2)" 1e-4;
    }
}

relaxationFactors
{
    equations
    {
//	U		0.85;
//	".*"		0.9;
        U               0.7; // 0.9 is more stable but 0.95 more convergent
        "(e|h|k|epsilon|omega)"   0.8; // 0.9 is more stable but 0.95 more convergent
    }
    fields
    {
	p		0.3;
    }
}


// ************************************************************************* //
