Strömungssimulation/Beleg/wü_dt/system/intWHF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the area averaged normal velocity at patches.

\*---------------------------------------------------------------------------*/

type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

log             true;
writeControl    timeStep;
writeInterval	10;
writeFields     false;

select          patch;
name            "pipe.*";

operation       areaIntegrate;

fields
(
    wallHeatFlux
);

// ************************************************************************* //
