Strömungssimulation/Beleg/wü_dt/system/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the heat-flux at wall patches, outputting the data as a
    volScalarField.

\*---------------------------------------------------------------------------*/

type            wallHeatFlux;
libs            ("libfieldFunctionObjects.so");

executeControl    timeStep;
executeInterval	10;
writeControl    writeTime;

// ************************************************************************* //
