Strömungssimulation/Beleg/wü_dt/system/writeObjects
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the specified objects, e.g. fields, stored in the case database.

\*---------------------------------------------------------------------------*/

type            writeObjects;
libs            ("libutilityFunctionObjects.so");

// INFO: Schreibe zusätzliche Felder für dynamische Viskosität mu und Wärmeleitfähigkeit kappa
objects         ("mu" "kappa");

writeControl    writeTime;

// ************************************************************************* //
